# utils/state_map.py

energy_map = {"1": "0–30%", "2": "31–60%", "3": "61–90%", "4": "91–100%"}
fatigue_map = {"1": "низкий", "2": "средний", "3": "высокий"}
motivation_map = {"1": "высокий", "2": "средний", "3": "низкий"}
psi_map = {"1": "чисто", "2": "фоновый гул", "3": "пси-шторм"}
sleep_map = {
    "1": "фаза 1.0",     # стабильная
    "2": "фаза 0.6",     # прерывание
    "3": "фаза 0.3",     # нестабильно
    "4": "фаза 0.0",     # отсутствие
}
social_map = {
    "1": "глушение",     # изоляция
    "2": "связь",        # готов к связи
    "3": "поиск",        # хочет поддержки
    "4": "шум",          # перегруз
}
voice_map = {
    "1": "опора",       # поддерживает
    "2": "тишина",      # молчит
    "3": "давление",    # критикует
    "4": "насмешка",    # высмеивает
}
